tutorials/case1 (copy)/constant/Air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/Air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       365427;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       367927;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          9780;
        startFace       370427;
    }
    Air_to_battery1
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          406;
        startFace       380207;
        neighbourRegion battery1;
        neighbourPatch  battery1_to_Air;
        transformType   none;
    }
)

// ************************************************************************* //
